# 1: Фильтрация данных

import pandas as pd

data = {
    "Имя": ["Анна", "Борис", "Влад", "Ольга"],
    "Возраст": [25, 34, 41, 28],
    "Город": ["Москва", "Санкт-Петербург", "Казань", "Сочи"]
}

df = pd.DataFrame(data)

print(df)

filtered_df = df[df["Возраст"] > 30]

print(filtered_df)



# 2: Группировка и агрегация

import pandas as pd

data = {
    "Имя": ["Анна", "Борис", "Влад", "Ольга", "Марина", "Роман", "Екатерина", "Виктор", "Ирина"],
    "Возраст": [25, 34, 41, 28, 19, 20, 36, 41, 38],
    "Город": ["Москва", "Санкт-Петербург", "Казань", "Сочи", "Санкт-Петербург", "Москва", "Санкт-Петербург", "Казань", "Сочи"]
}

df = pd.DataFrame(data)

print(df)

average_age = df.groupby("Город")["Возраст"].mean()

print(average_age)



# 3: Добавление нового столбца

import pandas as pd

data = {
    "Имя": ["Анна", "Борис", "Влад", "Ольга", "Марина", "Роман", "Екатерина", "Виктор", "Ирина"],
    "Возраст": [25, 34, 41, 28, 19, 20, 36, 41, 38],
    "Город": ["Москва", "Санкт-Петербург", "Казань", "Сочи", "Санкт-Петербург", "Москва", "Санкт-Петербург", "Казань", "Сочи"]
}

df = pd.DataFrame(data)

df["Статус"] = df["Возраст"].apply(lambda x: "Взрослый" if x >= 30 else "Молодой")

print(df)



# 4: Обработка пропущенных значений (NaN)

import pandas as pd
import numpy as np

data = {
    "Имя товара": ["Монитор", np.nan, "Мышка", "Клавиатура"],
    "Продажи": [15000, 23000, np.nan, 8000]
}

df = pd.DataFrame(data)

print(df)

df["Продажи"] = df["Продажи"].fillna(df["Продажи"].mean())

print(df)

df = df.dropna(subset=["Имя товара"])

print(df)

